---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookLineLenFactor
source: html/33c1aef7-67ec-9f3f-8870-7671e660a23c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookLineLenFactor Property

"Extension Multiplier"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookLineLenFactor { get; }
```